tutorials/single_phase_elastic/pillarsSolids/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p; //fluid pressure
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// for incompressible flow, pressure is specified as pressure/density
dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            zeroGradient;
    }

    outlet
    {
        type            totalPressure;
        p0              uniform 0;
    }

    walls
    {
        type            fixedFluxPressure;
    }
    geometry
    {
        type            fixedFluxPressure;
    }
    emptyFaces
    {
        type            empty;
    }
}

// ************************************************************************* //
